In [1]:
%matplotlib inline
import matplotlib
import seaborn as sns
matplotlib.rcParams['savefig.dpi'] = 144

# Structured Query Language (SQL)
<!-- requirement: data/customers.csv -->
<!-- requirement: data/products.csv -->
<!-- requirement: data/orders.csv -->

SQL is one of the most common computer languages in use for working with data today. It is a standardized language for accessing and manipulating relational databases. While it is relatively limited compared to a general programming language such as Python, it is highly optimized for efficient retrieval and aggregation of data from database tables. Its broad support and use virtually guarantees that any professional data scientist or analyst will encounter SQL eventually. Furthermore, SQL is often the paradigm used to discuss the relational data model, which has implications that apply beyond SQL compliant databases.

We will explore SQL from within Python, which will allow us to work with SQL in a familiar setting and also see opportunities for compatibility between the world of relational databases and data science tools within Python.

## Relational data model

The relational data model for the most part corresponds with our intuitive notion of a table. Each row is a **relation**, usually representing some object, event, or idea. Each column corresponds with an **attribute** which characterizes the relation. In order to reduce redundancy in a database, when creating at able we typically include the minimum amount of attributes required to fully define a relation. This (admittedly vague) guideline is formalized in the idea of [database normalization](https://en.wikipedia.org/wiki/Database_normalization).

For example, considering the following table representing orders from an online retailer.


Customer | ID | Order ID | Product ID | Price | Delivery Address | Billing Address
:-------:|:--:|:--------:|:----------:|:-----:|:----------------:|:---------------:
   Omar  | 435|   62353  |    103     |  6.95 |  ***** Munich, Germany | ***** Berlin, Germany |
   Omar  | 435|   62353  |    4028    |  35.50|  ***** Tunis, Tunisia  | ***** Berlin, Germany |
  Stuart |5692|   64598  |    103     |  6.95 |  ***** Dover, UK | ***** Dover, UK |
  Vidhya |6127|   64921  |    3158    | 101.99|  ***** Mumbai, India | ***** Mumbai, India |
  Vidhya |6127|   64989  |    2561    | 21.35 |  ***** Mumbai, India | ***** Mumbai, India |
  Vidhya |6127|   64989  |     89     | 16.95 |  ***** Mumbai, India | ***** Mumbai, India |
  Stuart |5692|   65271  |    103     |  6.95 |  ***** Dover, UK | ***** Dover, UK |  

In the above table we've reproduced many values several times such as customer names and IDs, addresses, prices, etc. We could break up this table into several smaller tables in which relations contain the minimal amount of attributes needed to define the relation. For instance, we may have a table for customers, a table for products, and a table for orders.

  Customer | ID | Billing Address
 :--------:|:--:|:---------------:
    Omar   | 435| ***** Berlin, Germany
   Stuart  |5692| ***** Dover, UK
   Vidhya  |6127| ***** Mumbai, India

 Product ID | Price
:----------:|:-----:
    103     |  6.95
   4028     | 35.50
   3158     | 101.99
   2561     | 21.35
    89      | 16.95

 Order ID | Customer ID | Product ID | Delivery Address
:--------:|:-----------:|:----------:|:----------------:
   62353  |     435     |    103     | ***** Munich, Germany
   62353  |     435     |    4028    | ***** Tunis, Tunisia
   64598  |    5692     |    103     | ***** Dover, UK
   64921  |    6127     |    3158    | ***** Mumbai, India
   64989  |    6127     |    2561    | ***** Mumbai, India
   64989  |    6127     |     89     | ***** Mumbai, India
   65271  |    5692     |    103     | ***** Dover, UK

Before we were storing 7 rows x 7 columns = 49 cells; now we're storing only 7 x 4 + 5 x 2 + 3 x 3 = 47 cells. This may not seem like a huge improvement, but realistically an online retailer may have millions of orders of a particular product. Reproducing the price in every order rather than storing it once per product could be quite costly when scaled up.

Let's explore how this would be implemented in SQL. We'll use `sqlite`, a basic SQL database manager that is useful for small data analysis and instructional purposes.

## Loading data in SQL

In [2]:
%load_ext sql
%sql sqlite:///testdb.sqlite

'Connected: @testdb.sqlite'

In [3]:
%%sql
--# The %%sql magic tells Jupyter to interpret this cell as SQL
--# In SQL comments begin with "--" (we add # to take advantage of Jupyter's syntax highlighting)

--# Since we're starting a new example, let's delete any existing tables
DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS products;
DROP TABLE IF EXISTS orders;

--# Now let's make our tables
CREATE TABLE customers (
    id                 INTEGER PRIMARY KEY NOT NULL,
    name               TEXT NOT NULL,
    billing_address    TEXT NOT NULL
);

CREATE TABLE products (
    id                 INTEGER PRIMARY KEY NOT NULL,
    price              NUMBER NOT NULL
);

CREATE TABLE orders (
    id                 INTEGER NOT NULL,
    customer_id        NUMBER NOT NULL,
    product_id         NUMBER NOT NULL,
    delivery_address   TEXT NOT NULL,
    FOREIGN KEY(customer_id) REFERENCES customers(id),
    FOREIGN KEY(product_id) REFERENCES products(id)
);

 * sqlite:///testdb.sqlite
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [4]:
%%sql

DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS products;
DROP TABLE IF EXISTS orders;

CREATE TABLE customers (id INTEGER PRIMARY KEY NOT NULL,
                        name TEXT NOT NULL,
                        billing_address TEXT NOT NULL
                       );

CREATE TABLE products (id INTEGER PRIMARY KEY NOT NULL,
                       price NUMBER NOT NULL
                      );

CREATE TABLE orders (id INTEGER NOT NULL, customer_id NUMBER NOT NULL, product_id NUMBER NOT NULL,
                     delivery_address TEXT NOT NULL, 
                     FOREIGN KEY(customer_id) REFERENCES customers(id),
                     FOREIGN KEY(product_id) REFERENCES products(id)
                    );

 * sqlite:///testdb.sqlite
Done.
Done.
Done.
Done.
Done.
Done.

[]

Our tables are initially empty, but we have defined the **schema** or structure of the tables. We've specified certain options in our schema, such as the fact that we do not accept null values in any field and that certain fields are unique primary keys. Many more options are possible, including setting default values for fields that could otherwise be null or instructing SQL to automatically assign incrementing values. If you haven't gotten the sense already, database architecture is an extensive subject!

We can inspect the table by using `SELECT`.

In [5]:
%%sql

SELECT * FROM customers;

 * sqlite:///testdb.sqlite
Done.

[]

Let's `INSERT` data into our tables.

We have to be careful to do this in a certain order; when we defined the `orders` table, we defined a relationship between the `customer_id` and `product_id` attributes and the `id` attributes in the `customer` and `product` tables respectively. We can only `INSERT`  data into the orders table once the appropriate customers and products exist in their tables.

In [6]:
%%sql

--# Starting with customers

INSERT INTO customers (id, name, billing_address)
    VALUES (435, 'Omar', 'Berlin, Germany'), (5692, 'Stuart', 'Dover, UK'), (6127, 'Vidhya', 'Mumbai, India');

INSERT INTO products (id, price)
    VALUES (103, 6.95), (4028, 35.5), (3158, 101.99), (2561, 21.35), (89, 16.95);

INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES (62353, 435, 103, 'Munich, Germany'), (62353, 435, 4028, 'Tunis, Tunisia');

INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES (64598, 5692, 103, 'Dover, UK'), (65271, 5692, 103, 'Dover, UK');

INSERT INTO orders (id, customer_id, product_id, delivery_address)
    VALUES (64921, 6127, 3158, 'Mumbai, India'), (64989, 6127, 2561, 'Mumbai, India'), (64989, 6127, 89, 'Mumbai, India');

 * sqlite:///testdb.sqlite
Done.
5 rows affected.
2 rows affected.
2 rows affected.
3 rows affected.

[]

In [7]:
%%sql

SELECT * FROM orders;

 * sqlite:///testdb.sqlite
Done.

[(62353, 435, 103, 'Munich, Germany'),
 (62353, 435, 4028, 'Tunis, Tunisia'),
 (64598, 5692, 103, 'Dover, UK'),
 (65271, 5692, 103, 'Dover, UK'),
 (64921, 6127, 3158, 'Mumbai, India'),
 (64989, 6127, 2561, 'Mumbai, India'),
 (64989, 6127, 89, 'Mumbai, India')]

In [8]:
%%sql

select * from products;

 * sqlite:///testdb.sqlite
Done.

[(89, 16.95), (103, 6.95), (2561, 21.35), (3158, 101.99), (4028, 35.5)]

In [9]:
%%sql
SELECT * FROM customers;

 * sqlite:///testdb.sqlite
Done.

[(435, 'Omar', 'Berlin, Germany'),
 (5692, 'Stuart', 'Dover, UK'),
 (6127, 'Vidhya', 'Mumbai, India')]

Let's confirm that our tables have been updated with the data from our example.

In [10]:
%%sql

SELECT * FROM customers;

 * sqlite:///testdb.sqlite
Done.

[(435, 'Omar', 'Berlin, Germany'),
 (5692, 'Stuart', 'Dover, UK'),
 (6127, 'Vidhya', 'Mumbai, India')]

In [11]:
%%sql

SELECT * FROM products;

 * sqlite:///testdb.sqlite
Done.

[(89, 16.95), (103, 6.95), (2561, 21.35), (3158, 101.99), (4028, 35.5)]

In [12]:
%%sql

SELECT * FROM orders;

 * sqlite:///testdb.sqlite
Done.

[(62353, 435, 103, 'Munich, Germany'),
 (62353, 435, 4028, 'Tunis, Tunisia'),
 (64598, 5692, 103, 'Dover, UK'),
 (65271, 5692, 103, 'Dover, UK'),
 (64921, 6127, 3158, 'Mumbai, India'),
 (64989, 6127, 2561, 'Mumbai, India'),
 (64989, 6127, 89, 'Mumbai, India')]

Databases are commonly used for persistent data storage, and therefore it is common to add or remove rows as new data is created (e.g. someone places an order) or destroyed (e.g. a product is discontinued). This may be performed automatically via an application's **database connection**; we will use database connections later in this notebook. However, in the mean time we will load in a larger version of the above data set from file for analysis.

In [13]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("testdb.sqlite")
customers = pd.read_csv('data/customers.csv')
products = pd.read_csv('data/products.csv')
orders = pd.read_csv('data/orders.csv')

customers.to_sql("customers", conn, index=False, if_exists="replace")
products.to_sql("products", conn, index=False, if_exists="replace")
orders.to_sql("orders", conn, index=False, if_exists="replace")

In [14]:
%%sql
SELECT * FROM customers
    LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(1, 'Serenity Ladner', 'Canada'),
 (2, 'Lucy Baldwin', 'Canada'),
 (5, 'Skylar Coffman', 'USA'),
 (6, 'Riley Kinsey', 'USA'),
 (7, 'Heidi Spurlock', 'Canada'),
 (10, 'Makenna Rojas', 'Canada'),
 (15, 'Lillian Strange', 'Canada'),
 (17, 'Erin Gorman', 'Canada'),
 (18, 'Abigail Le', 'USA'),
 (22, 'Alana Herzog', 'USA')]

## Filtering and sorting data

Filtering is principally accomplished using the `WHERE` command.

In [15]:
%%sql

SELECT * FROM orders WHERE delivery_country = 'Germany' LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(8, 303, 749, 'Germany'),
 (27, 459, 606, 'Germany'),
 (35, 1361, 482, 'Germany'),
 (35, 1361, 28, 'Germany'),
 (35, 1361, 615, 'Germany'),
 (35, 1361, 732, 'Germany'),
 (37, 1380, 301, 'Germany'),
 (45, 2040, 23, 'Germany'),
 (55, 1396, 895, 'Germany'),
 (55, 1396, 846, 'Germany')]

In [16]:
%%sql

SELECT id, delivery_country FROM orders
WHERE delivery_country = 'India'
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(0, 'India'),
 (60, 'India'),
 (60, 'India'),
 (60, 'India'),
 (64, 'India'),
 (66, 'India'),
 (66, 'India'),
 (68, 'India'),
 (103, 'India'),
 (103, 'India')]

In [17]:
%%sql

SELECT * FROM products
WHERE price > 20
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(0, 21.78),
 (2, 24.17),
 (3, 29.71),
 (4, 20.12),
 (5, 27.55),
 (7, 26.75),
 (8, 21.49),
 (9, 26.35),
 (10, 31.74),
 (11, 22.28)]

We can additionally combine `WHERE` with `LIKE` for pattern matching an `IN` for membership.

In [18]:
%%sql

SELECT id, delivery_country FROM orders
WHERE delivery_country like 'S%'
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(2, 'Spain'),
 (11, 'Senegal'),
 (16, 'Sweden'),
 (16, 'Sweden'),
 (16, 'Sweden'),
 (21, 'Spain'),
 (21, 'Slovakia'),
 (30, 'Spain'),
 (38, 'South Korea'),
 (45, 'Sweden')]

In [19]:
%%sql

SELECT * FROM orders WHERE delivery_country LIKE 's%' LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(2, 1907, 353, 'Spain'),
 (11, 284, 338, 'Senegal'),
 (16, 422, 864, 'Sweden'),
 (16, 422, 812, 'Sweden'),
 (16, 422, 843, 'Sweden'),
 (21, 197, 994, 'Spain'),
 (21, 197, 518, 'Slovakia'),
 (30, 1223, 974, 'Spain'),
 (38, 962, 266, 'South Korea'),
 (45, 2040, 576, 'Sweden')]

In [20]:
%%sql

SELECT * FROM orders
WHERE customer_id IN (10, 200, 400);

 * sqlite:///testdb.sqlite
Done.

[(211, 200, 858, 'Madagascar'),
 (211, 200, 434, 'Mexico'),
 (542, 400, 80, 'Sweden'),
 (542, 400, 405, 'Sweden'),
 (818, 10, 778, 'Canada'),
 (818, 10, 60, 'Canada')]

We can also combine them with the usual logical operators: `AND`, `OR`, and `NOT`.

In [21]:
%%sql

SELECT * FROM orders
WHERE customer_id IN (10, 200, 400)
AND delivery_country NOT IN ('Madagascar', 'Canada');

 * sqlite:///testdb.sqlite
Done.

[(211, 200, 434, 'Mexico'),
 (542, 400, 80, 'Sweden'),
 (542, 400, 405, 'Sweden')]

In [22]:
%%sql

SELECT * FROM products
WHERE price < 10 OR price > 30
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(10, 31.74),
 (17, 7.27),
 (22, 33.03),
 (41, 8.98),
 (44, 5.8),
 (54, 35.6),
 (57, 6.67),
 (72, 33.26),
 (78, 9.01),
 (104, 33.24)]

To sort our results, we can `ORDER BY` one or more columns. We can also choose whether we sort in ascending (`ASC`) or descending (`DESC`) order. SQL sorts in ascending order by default.

In [23]:
%%sql

SELECT * FROM orders
ORDER BY customer_id
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(189, 1, 307, 'Canada'),
 (189, 1, 508, 'Poland'),
 (949, 1, 431, 'Canada'),
 (949, 1, 592, 'Canada'),
 (146, 5, 263, 'USA'),
 (146, 5, 688, 'USA'),
 (146, 5, 293, 'USA'),
 (146, 5, 864, 'USA'),
 (391, 5, 635, 'Czech Republic'),
 (391, 5, 380, 'USA')]

In [24]:
%%sql

SELECT * FROM orders
ORDER BY customer_id ASC, product_id DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(949, 1, 592, 'Canada'),
 (189, 1, 508, 'Poland'),
 (949, 1, 431, 'Canada'),
 (189, 1, 307, 'Canada'),
 (146, 5, 864, 'USA'),
 (146, 5, 688, 'USA'),
 (391, 5, 635, 'Czech Republic'),
 (977, 5, 523, 'USA'),
 (391, 5, 497, 'Slovenia'),
 (391, 5, 380, 'USA')]

## Data aggregation

Most of the standard data aggregation functions are available in SQL (`COUNT`, `SUM`, `DISTINCT`, `MAX`, etc.) although exactly what is available and what it is called varies by dialect.

In [25]:
%%sql

SELECT id, MAX(price) FROM products;

 * sqlite:///testdb.sqlite
Done.

[(381, 39.91)]

In [26]:
%%sql

SELECT id, MIN(price) FROM products;

 * sqlite:///testdb.sqlite
Done.

[(44, 5.8)]

In [27]:
%%sql

SELECT * FROM products WHERE price = 5.8;

 * sqlite:///testdb.sqlite
Done.

[(44, 5.8)]

In [28]:
%%sql

SELECT AVG(price), MAX(price) FROM products;

 * sqlite:///testdb.sqlite
Done.

[(19.98996999999997, 39.91)]

As usual, we are often interested in aggregating our data within certain groups. As in Pandas, we will use `GROUP BY` to accomplish this. Remember -- if we are performing a `groupby`, any other attributes we select must be aggregated by some aggregation function.

In [29]:
%%sql

SELECT * FROM orders
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(0, 1866, 686, 'India'),
 (1, 1921, 617, 'China'),
 (1, 1921, 54, 'Armenia'),
 (1, 1921, 566, 'China'),
 (1, 1921, 128, 'Lebanon'),
 (1, 1921, 976, 'China'),
 (2, 1907, 353, 'Spain'),
 (3, 1464, 330, 'Denmark'),
 (3, 1464, 555, 'Denmark'),
 (4, 206, 960, 'Mexico')]

In [30]:
%%sql

SELECT * FROM orders
ORDER BY delivery_country
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(60, 815, 215, 'Albania'),
 (329, 32, 826, 'Albania'),
 (378, 1483, 31, 'Albania'),
 (395, 2096, 394, 'Albania'),
 (586, 1460, 548, 'Albania'),
 (724, 1442, 957, 'Albania'),
 (724, 1442, 628, 'Albania'),
 (761, 197, 316, 'Albania'),
 (951, 1442, 614, 'Albania'),
 (968, 1772, 541, 'Albania')]

In [31]:
%%sql

SELECT *, COUNT(DISTINCT(id)) FROM orders
GROUP BY delivery_country
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(60, 815, 215, 'Albania', 9),
 (41, 1761, 765, 'Algeria', 17),
 (11, 284, 718, 'Angola', 7),
 (1, 1921, 54, 'Armenia', 2),
 (44, 355, 607, 'Austria', 9),
 (113, 2082, 524, 'Azerbaijan', 4),
 (450, 1980, 754, 'Bahrain', 5),
 (39, 376, 642, 'Belarus', 17),
 (36, 395, 716, 'Benin', 8),
 (351, 1882, 228, 'Bosnia', 3)]

In [32]:
%%sql

SELECT COUNT(DISTINCT(id)), customer_id, product_id, delivery_country FROM orders
GROUP BY delivery_country
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(9, 815, 215, 'Albania'),
 (17, 1761, 765, 'Algeria'),
 (7, 284, 718, 'Angola'),
 (2, 1921, 54, 'Armenia'),
 (9, 355, 607, 'Austria'),
 (4, 2082, 524, 'Azerbaijan'),
 (5, 1980, 754, 'Bahrain'),
 (17, 376, 642, 'Belarus'),
 (8, 395, 716, 'Benin'),
 (3, 1882, 228, 'Bosnia')]

In [33]:
%%sql

SELECT delivery_country, COUNT(DISTINCT(id)) AS count FROM orders
GROUP BY delivery_country
ORDER BY count DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('India', 60),
 ('China', 60),
 ('Germany', 59),
 ('Russia', 42),
 ('South Korea', 37),
 ('Japan', 37),
 ('USA', 36),
 ('Spain', 36),
 ('Canada', 35),
 ('France', 31)]

In [34]:
%%sql

SELECT delivery_country, COUNT(DISTINCT(id)) AS count FROM orders
GROUP BY delivery_country
ORDER BY count DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('India', 60),
 ('China', 60),
 ('Germany', 59),
 ('Russia', 42),
 ('South Korea', 37),
 ('Japan', 37),
 ('USA', 36),
 ('Spain', 36),
 ('Canada', 35),
 ('France', 31)]

## Joining tables together

Since we have split up our data among several tables to reduce redundancy, we will have to join tables together to compute certain values we might be interested in. For instance, how might we calculate the total revenue from all orders? We could take a sum of the price associated with each item in each order, but in order to do so, we must `JOIN` the `products` table to the `orders` table `ON` the shared attribute: `product_id` (from the `orders` table) and `id` (from the `products` table).

Since joins involve fields from multiple tables, we'll frequently alias a table `AS` some abbreviation to save ourselves some typing.

In [35]:
%%sql

SELECT * FROM orders AS o
JOIN products AS p
ON o.product_id = p.id
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(0, 1866, 686, 'India', 686, 26.62),
 (1, 1921, 617, 'China', 617, 8.61),
 (1, 1921, 54, 'Armenia', 54, 35.6),
 (1, 1921, 566, 'China', 566, 23.32),
 (1, 1921, 128, 'Lebanon', 128, 13.73),
 (1, 1921, 976, 'China', 976, 29.55),
 (2, 1907, 353, 'Spain', 353, 16.81),
 (3, 1464, 330, 'Denmark', 330, 14.39),
 (3, 1464, 555, 'Denmark', 555, 19.12),
 (4, 206, 960, 'Mexico', 960, 19.96)]

In [36]:
%%sql

SELECT SUM(price) FROM orders AS o
JOIN products AS p
ON o.product_id = p.id

 * sqlite:///testdb.sqlite
Done.

[(39988.80999999999,)]

In [37]:
%%sql

SELECT * FROM orders o, products p
WHERE o.product_id = p.id
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(0, 1866, 686, 'India', 686, 26.62),
 (1, 1921, 617, 'China', 617, 8.61),
 (1, 1921, 54, 'Armenia', 54, 35.6),
 (1, 1921, 566, 'China', 566, 23.32),
 (1, 1921, 128, 'Lebanon', 128, 13.73),
 (1, 1921, 976, 'China', 976, 29.55),
 (2, 1907, 353, 'Spain', 353, 16.81),
 (3, 1464, 330, 'Denmark', 330, 14.39),
 (3, 1464, 555, 'Denmark', 555, 19.12),
 (4, 206, 960, 'Mexico', 960, 19.96)]

In [38]:
%%sql

SELECT SUM(price) FROM orders o, products p
WHERE o.product_id = p.id

 * sqlite:///testdb.sqlite
Done.

[(39988.80999999999,)]

In [39]:
%%sql

SELECT SUM(p.price) FROM orders AS o
JOIN products AS p ON o.product_id = p.id;

 * sqlite:///testdb.sqlite
Done.

[(39988.80999999999,)]

There are often several ways to perform a join. We can usually rely on our database management software to work out the details of the most efficient way to perform the join, although there are exceptions.

In [40]:
%%sql

SELECT SUM(p.price)
FROM orders o, products p
WHERE p.id = o.product_id;

 * sqlite:///testdb.sqlite
Done.

[(39988.80999999999,)]

In [41]:
%%sql

SELECT * FROM
customers c, orders o, products p
WHERE c.id = o.customer_id AND p.id = o.product_id
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[(1, 'Serenity Ladner', 'Canada', 189, 1, 307, 'Canada', 307, 16.13),
 (1, 'Serenity Ladner', 'Canada', 189, 1, 508, 'Poland', 508, 19.55),
 (1, 'Serenity Ladner', 'Canada', 949, 1, 431, 'Canada', 431, 19.18),
 (1, 'Serenity Ladner', 'Canada', 949, 1, 592, 'Canada', 592, 23.4),
 (5, 'Skylar Coffman', 'USA', 146, 5, 263, 'USA', 263, 23.79),
 (5, 'Skylar Coffman', 'USA', 146, 5, 293, 'USA', 293, 24.75),
 (5, 'Skylar Coffman', 'USA', 146, 5, 688, 'USA', 688, 22.3),
 (5, 'Skylar Coffman', 'USA', 146, 5, 864, 'USA', 864, 24.18),
 (5, 'Skylar Coffman', 'USA', 391, 5, 380, 'USA', 380, 22.99),
 (5, 'Skylar Coffman', 'USA', 391, 5, 497, 'Slovenia', 497, 12.8)]

In [42]:
%%sql
SELECT * FROM
    (SELECT * FROM
     customers c, orders o, products p
     WHERE c.id = o.customer_id AND p.id = o.product_id) joined
WHERE id = 1;

 * sqlite:///testdb.sqlite
Done.

[(1, 'Serenity Ladner', 'Canada', 189, 1, 307, 'Canada', 307, 16.13),
 (1, 'Serenity Ladner', 'Canada', 189, 1, 508, 'Poland', 508, 19.55),
 (1, 'Serenity Ladner', 'Canada', 949, 1, 431, 'Canada', 431, 19.18),
 (1, 'Serenity Ladner', 'Canada', 949, 1, 592, 'Canada', 592, 23.4)]

In [43]:
%%sql
SELECT * FROM
    (SELECT * FROM
     customers c, orders o, products p
     WHERE c.id = o.customer_id AND p.id = o.product_id) joined
WHERE name = 'Skylar Coffman';

 * sqlite:///testdb.sqlite
Done.

[(5, 'Skylar Coffman', 'USA', 146, 5, 263, 'USA', 263, 23.79),
 (5, 'Skylar Coffman', 'USA', 146, 5, 293, 'USA', 293, 24.75),
 (5, 'Skylar Coffman', 'USA', 146, 5, 688, 'USA', 688, 22.3),
 (5, 'Skylar Coffman', 'USA', 146, 5, 864, 'USA', 864, 24.18),
 (5, 'Skylar Coffman', 'USA', 391, 5, 380, 'USA', 380, 22.99),
 (5, 'Skylar Coffman', 'USA', 391, 5, 497, 'Slovenia', 497, 12.8),
 (5, 'Skylar Coffman', 'USA', 391, 5, 635, 'Czech Republic', 635, 19.2),
 (5, 'Skylar Coffman', 'USA', 977, 5, 523, 'USA', 523, 10.23)]

In [44]:
%%sql
SELECT name, SUM(price) AS spent FROM
    (SELECT * FROM
     customers c, orders o, products p
     WHERE c.id = o.customer_id AND p.id = o.product_id) joined
GROUP BY name
ORDER BY spent DESC;

 * sqlite:///testdb.sqlite
Done.

[('Sevil Caker', 315.09000000000003),
 ('Pons Baluze', 306.8499999999999),
 ('Boikai Owiti', 297.10999999999996),
 ('Ahmed Onyango', 291.38000000000005),
 ('Bui Tuan', 274.91999999999996),
 ('Seth Bowden', 270.44),
 ('Sandra Lakatos', 267.03999999999996),
 ('Jonas Papp', 265.48),
 ('Kristina Hovath', 263.03999999999996),
 ('Vasha Nwosu', 260.15000000000003),
 ('Latoya Omondi', 259.79),
 ('Kaiden Ocampo', 257.58000000000004),
 ('Lucas Eschenbach', 255.31),
 ('Hunter Sherman', 242.32000000000002),
 ('Anna Dvorak', 238.50000000000003),
 ('Cariman Kotla', 235.9),
 ('Hou Feng-ying', 230.62),
 ('Hugo Johnsen', 228.93),
 ('Pi Fu-quan', 227.56),
 ('Cumhur Ozdemir', 224.34),
 ('Hollye Thompson', 220.64),
 ('Chi Ok-myung', 219.10000000000002),
 ('Nahweh Desta', 217.83),
 ('Riley Kinsey', 217.57000000000002),
 ('Nichelle Gashi', 212.96),
 ('Crystal Barney', 211.5),
 ('Kun Hui-ying', 209.13000000000002),
 ('Leah Metterling', 207.62),
 ('Tsuneari Sakanoue', 207.23999999999998),
 ('Lena Oshin', 206.70000000000005),
 ('Catulle Mazarin', 205.40999999999997),
 ('Ida Petersson', 202.57),
 ('Winta Abraha', 201.97000000000003),
 ('Hassan El Sayed', 200.85999999999999),
 ('Nagla Mahfouz', 200.64000000000001),
 ('Leevi Nilsen', 200.34000000000003),
 ('Marta Samper Castanada', 200.18000000000004),
 ('Amarajyoti Rajaraman', 198.39999999999998),
 ('Majd Waqar', 198.21),
 ('Ksenia Ivanov', 196.3),
 ('Claudia Canete Orteguilla', 190.79000000000002),
 ('Marzouq Al-Razi', 189.41),
 ('Sui Tso-i', 188.7),
 ('Robin Kask', 187.29),
 ('Arkaprakasa Kesiraju', 185.23000000000002),
 ('Lu Hua-ding', 184.32),
 ('Bina Tella', 179.52),
 ('Rea Benincasa', 179.05999999999997),
 ('Daniil Volkov', 177.28),
 ('Xie Kuei-fen', 176.77),
 ('Ananda Gashi', 176.32999999999998),
 ('Anugra Vamshi', 175.42000000000002),
 ('Zebediah Green', 174.74999999999997),
 ('Alana Herzog', 174.0),
 ('Tokie Hattori', 172.14000000000001),
 ('Akram Izadi', 171.48),
 ('Carlos Krause', 170.42000000000002),
 ('Veeti Gustavsson', 170.22000000000003),
 ('Jariah Desta', 170.21),
 ('Tatiana Lebedev', 170.16),
 ('Sahana Vasuman', 169.45000000000002),
 ('Rossanna Colombi', 166.97),
 ('Azalais LabanDe_Labaye', 166.95000000000002),
 ('Luca Jaekle', 160.94000000000003),
 ('Skylar Coffman', 160.23999999999998),
 ('Marcin Oja', 160.15),
 ('Anastasiya Semyonov', 159.07),
 ('Hugo Rollero Chilavert', 158.66),
 ('Filip Pettersson', 157.88),
 ('Bina Cossiga', 155.38),
 ('Tobias Oberhofner', 154.97),
 ('Anangam Ramamuthe', 154.91),
 ('Lucia Massana Feliu', 154.76999999999998),
 ('Anna Fliehman', 154.2),
 ('Tsung Xiang-ling', 152.73000000000002),
 ('Yamah Hailesellasie', 151.35999999999999),
 ('Aleksi Laine', 151.17999999999998),
 ('Eichiro Aihara', 150.97),
 ('Woo Mi-kum', 150.39000000000001),
 ('Penelope Robinson', 149.75),
 ('Lukas Specht', 148.04),
 ('Yael Golan', 147.88),
 ('Shon Jae-Kwang', 146.61),
 ('Tonia Adoyo', 145.05),
 ('Nokrashy Allam', 143.56),
 ('Fokra Berhane', 143.42),
 ('Pham Phuc', 142.87),
 ('Yuri Kozlov', 142.34),
 ('Anne Magel', 142.23),
 ('Son Myung-sun', 142.05999999999997),
 ('Martin Szucs', 141.82999999999998),
 ('Anna Kukk', 141.57999999999998),
 ('Toichi Amaya', 140.91),
 ('Boutros Al Effendi', 139.80999999999997),
 ('Lopan Fook', 139.71),
 ('Tobias Bracher', 139.11),
 ('Laura Gaspar Raimondi', 138.57),
 ('Sara Persson', 138.54000000000002),
 ('Enrique  Curran', 138.18),
 ('Tan Fei', 135.89),
 ('Jabaar Ishraqi', 130.92000000000002),
 ('Naoya Kawatake', 130.9),
 ('Sofia Morozov', 130.87),
 ('Tobias Eriksen', 130.24),
 ('Marie Stroebel', 129.85),
 ('Tazara Sy', 129.61),
 ('Tanginika Chahine', 129.54000000000002),
 ('Hassan Shehata', 129.38),
 ('Martin Parn', 127.61999999999999),
 ('Bui Thom', 127.31),
 ('Nicol Malcah', 126.82),
 ('Nikola Molnar', 126.67999999999999),
 ('Mufidah Sumech', 126.66),
 ('Chi Chae-Pil', 126.17000000000002),
 ('Yoruba Demoz', 124.85),
 ('Zinnah Omondi', 124.79000000000002),
 ('Katharina Gerg', 124.66000000000001),
 ('Dionigi Avanzi', 124.47),
 ('Sander Nemeth', 124.14000000000001),
 ('Lukas Juhasz', 123.78),
 ('Motoyuki Omura', 121.37),
 ('Hanna Jacobsen', 120.28),
 ('Yael Amar', 120.26),
 ('Tamar David', 119.40999999999998),
 ('Shimei Kuramochi', 117.36),
 ('Truly Johnson', 117.12),
 ('Emma Petersson', 116.87),
 ('Yuri Lebedev', 116.62),
 ('Azeeza Al-Dossari', 116.49999999999999),
 ('Naina Mista', 116.41),
 ('Enriqueta Rovirosa Sarachaga', 116.30999999999997),
 ('Pawel Pinter', 115.35999999999999),
 ('Abbas  Aksu', 115.03),
 ('Chioma Ballo', 114.37),
 ('Ngo Vuong', 113.14),
 ('Onofredo Tasso', 113.0),
 ('Choe Jin-guo', 112.81),
 ('Wyiata Hailemariam', 112.53),
 ('Ahladita Yeshonath', 112.16),
 ('Theresa Kocsis', 111.13999999999999),
 ('Astrita Daruka', 111.13),
 ('Jitya Garikapaty', 111.03999999999999),
 ('Aytac Sahin', 110.7),
 ('Jorge Peterson', 110.50999999999999),
 ('Natasha Bogdanov', 110.19000000000001),
 ('Haatim Al-Mutadee', 109.94),
 ('Afeef Zahed', 109.6),
 ('Anandi Sinduvalli', 108.59),
 ('Yolande Montrosier', 108.39000000000001),
 ('Oso Jalloh', 108.03),
 ('Kum Su-yin', 107.99000000000001),
 ('Jean-Marc Chambon', 106.94000000000001),
 ('Marietta Menicossa', 106.91),
 ('Vaughn White', 106.22),
 ('Takamuku Ohira', 105.66),
 ('Aparna Pasram', 104.94),
 ('Rheem Seung-Hwa', 104.15),
 ('Enrique Serdan Pulido', 103.34),
 ('Wleh Atieno', 103.17),
 ('Erin Gorman', 102.31),
 ('Najya Javed', 101.85),
 ('Oscar Jonsson', 101.77000000000001),
 ('Jakub Balazs', 101.53999999999999),
 ('Shang Xin-fang', 100.48),
 ('Sempronia Bonauiti', 100.05),
 ('Arabelle Perrin', 98.29),
 ('Martin Simon', 97.95),
 ('Bakula Harishandra', 97.5),
 ('Lucas Knueven', 97.33999999999999),
 ('Felix Maurer', 96.83),
 ('Simon Mittermayer', 96.82999999999998),
 ('Wafa Mushtaq-bin-Mohammad', 96.59),
 ("Ma/'n Khanlary", 96.45),
 ('Nudar Vafa/i', 96.35),
 ('Austin Cummings', 96.12),
 ('Vladimir Semyonov', 95.77),
 ('Dang Sinh', 95.15),
 ('Nicole Fitch', 94.89),
 ('Nadia Portillo Parada', 94.09),
 ('Daniel Grogan', 93.74),
 ('Ansu Onyango', 93.63),
 ('Malika Tewoldeberhan', 93.60000000000001),
 ('Ida Olsen', 93.33),
 ('Bridgnandan Pallavan', 93.14000000000001),
 ('Katherine Tamm', 92.67),
 ('Elvia Buentello', 92.50999999999999),
 ('Natalie Koppel', 91.89),
 ('Kamalalocana Eknath', 91.68),
 ('Kirtita Solanki', 91.24000000000001),
 ('Nimeesha Osei', 90.28),
 ('Lin Po-sin', 89.05000000000001),
 ('Guadalupe Childers', 88.08999999999999),
 ('Bao Xu-xa', 87.59),
 ('Garron Wood', 86.78),
 ('Jonas Novak', 86.74999999999999),
 ('Esen Baykal', 86.33),
 ('Chao Wu-jiang', 86.02000000000001),
 ('William Karlsson', 85.88),
 ('Fang Lu', 85.54),
 ('June Moran Chaves', 84.62),
 ('Fang Ching-hsia', 84.10999999999999),
 ('Thaqib Abelzada', 83.12),
 ('Aura Santa Godoy', 83.07),
 ('Abigail Le', 82.92),
 ('Ayana Sow', 82.72999999999999),
 ('Juzaburo Nemoto', 82.67999999999999),
 ('Ma Sang-jin', 82.47),
 ('Anatoly Smirnov', 82.13),
 ('Marie Krausse', 81.59),
 ('Lucia Edinho Ferrer', 81.28),
 ('Moneim Sabry', 81.00999999999999),
 ('Sandra Parn', 80.22),
 ('Kareema Vahdat', 78.58),
 ('Sofia Vasilyev', 78.51),
 ('Serenity Ladner', 78.25999999999999),
 ('Arganjan Sangodkar', 78.18),
 ('Takamori Okumura', 77.57),
 ('Corin Auber', 77.56),
 ('Simon Schavillie', 76.43),
 ('Kalyanavarman Niveda', 76.32),
 ('Hoong I-po', 76.3),
 ('Zeng De', 74.92),
 ('Druti Chatterjee', 74.78999999999999),
 ('Kande Sane', 74.67),
 ('Nikolai Golyubev', 74.3),
 ('Laura Szilagyi', 74.28999999999999),
 ('Lukas Schwetschenau', 74.09),
 ('Motoshige Obinata', 73.7),
 ('Alexander Aschenbach', 73.64),
 ('Mena Pooja', 73.09),
 ('Qatadah Shouaa', 72.61),
 ('Kwan Du', 72.55000000000001),
 ('Sun Yun-Bok', 71.96),
 ('Iesada Etsuko', 71.61),
 ('Thea Johansen', 71.25),
 ('David Terrazos Arellano', 70.57),
 ('Filippo Majarelli', 69.89),
 ('Isidoro Blas Lugo', 69.47),
 ('Ferrandos Bautain', 68.6),
 ('Xiao Ming-zing', 67.47999999999999),
 ('Oscar Svensson', 67.18),
 ('Han Eun-seong', 67.18),
 ('Ayuddha Ramji', 67.12),
 ('Yaaseen Maradi', 66.53),
 ('Amelia Sosa', 66.43),
 ('Colton Felix', 66.16),
 ('Shin Chulsoon', 65.63),
 ('Paul Frankenheimer', 65.62),
 ('Bang Seong-shin', 65.34),
 ('Fabian Thon', 64.74),
 ('Ethel Edwards', 64.26),
 ('Acanda Kodanda', 63.91),
 ('Leandra Vigil Garcia', 63.62),
 ('Karolina Szilagyi', 63.57),
 ('Shira Tal', 63.22),
 ('Inna Novikov', 63.21),
 ('Yegor Vorobyrov', 61.93),
 ('Igor Kozlov', 61.75),
 ('Yehonatan Levi', 61.69),
 ('Momolu Okeke', 61.56),
 ('Vu Bao', 61.55),
 ('Chuko Gui-fan', 61.55),
 ('Falala Wangai', 61.089999999999996),
 ('Tokpah Fall', 60.61),
 ('Baasal Malcah', 60.24),
 ('Oh Seung-Mee', 60.11),
 ('Marcin Olah', 59.489999999999995),
 ('Asirisa Kaalki', 59.379999999999995),
 ('Jumanah Karim', 59.339999999999996),
 ('Filip Oja', 59.230000000000004),
 ('Misato Arishima', 59.07),
 ('Silvia Trujillo Telles', 58.87),
 ('Aleksey Popov', 58.86),
 ('Sulpice Reaume', 58.55),
 ('Chi Hee-yun', 57.93),
 ('Lena Wise', 57.88),
 ('Sara Lindberg', 57.54),
 ('Jan Lakatos', 56.739999999999995),
 ('Felix Guenthner', 56.67),
 ('Tyronica Turay', 56.629999999999995),
 ('Sidiki Wangai', 56.02),
 ('Siiri Larsen', 55.99),
 ('Chu An', 55.870000000000005),
 ('Alexsandr Morozov', 54.67000000000001),
 ('Ugs Janin', 53.78),
 ('Mosheh Hadad', 53.43000000000001),
 ('Harumi Tokudaiji', 52.7),
 ('Tandice Sylla', 52.129999999999995),
 ('Jo Young-nae', 52.099999999999994),
 ('Abhayananda Pillay', 51.91),
 ('Arya Vallath', 51.69),
 ('Arub Estilidaei', 51.39),
 ('Wilma Bengtsson', 51.35),
 ('Alexander Jacobsen', 51.24),
 ('Anna Kraushaar', 50.83),
 ('Alexander Pedersen', 50.489999999999995),
 ('Cengiz Ozdemir', 50.440000000000005),
 ('Abbas Salimpour', 50.440000000000005),
 ('Jan Novak', 50.32000000000001),
 ('Erdal Yilmaz', 50.269999999999996),
 ('Ozelm  Erbil', 49.68),
 ('Emil Olsen', 49.510000000000005),
 ('Kazuhiro Nijo', 48.78),
 ('Anna Marek', 48.74),
 ('Felix Rantzen', 48.699999999999996),
 ('Adara Ikram', 48.650000000000006),
 ('Kareema Anvari', 48.410000000000004),
 ('Iida Johansson', 46.459999999999994),
 ('Jared Clarke', 46.34),
 ('Alex Ussica Miralles', 46.05),
 ('Gibson Davies', 45.84),
 ('Makenna Rojas', 45.57),
 ('Roger Osei', 45.46),
 ('Kristyna Kocsis', 45.370000000000005),
 ('Ti Wu-jiang', 44.58),
 ('Tokpah Hailemariam', 44.54),
 ('William Petersson', 44.53),
 ('Kamaraja Shrivastava', 44.16),
 ('Nikolai Ivanov', 43.09),
 ('Vanessa Kirchhoff', 42.47),
 ('Ciman Pandit', 42.36),
 ('Koo Byung-soon', 42.29),
 ('Eber Castano Fernandez Davila', 42.04),
 ('Thomas Beautell', 41.95),
 ('Fataah Akhlaqi', 41.94),
 ('Ruwaydah Diba', 41.67),
 ('Marcin Tamm', 41.46),
 ('Kochiyo Fukao', 41.269999999999996),
 ('Aada Magnusson', 41.21),
 ('Mariam Alam', 41.05),
 ('Ryom Chan-sook', 40.88),
 ('Anna Smirnov', 40.19),
 ('Diana Kovacs', 39.53),
 ('Urbano Delogu', 39.4),
 ('Majd Vahdat', 39.31),
 ('Huie Hui-fang', 39.29),
 ('Candragolika Vuppula', 39.019999999999996),
 ('Siafa Omondi', 38.91),
 ('Julie Jansson', 38.54),
 ('Damone Alicata', 38.42),
 ('Gerard Minguet Concepcion', 37.98),
 ('Nazirah Bakahasab', 37.95),
 ('Isaiah Flint', 37.57),
 ('Benjamin Snyder', 37.5),
 ('Iida Larsson', 37.44),
 ('Alejandro Santos Seda', 36.75),
 ('Uberto Pedercini', 36.72),
 ('Zabia Nwosu', 36.38),
 ('Irina Lebedev', 36.26),
 ('Malar Koppala', 35.97),
 ('Janardhan Salil', 35.91),
 ('Daniel Aguirre Cordobes', 35.7),
 ('Guo Hsi-men', 35.599999999999994),
 ('Silvestro Borghini', 35.11),
 ('Alia Hejazi', 34.870000000000005),
 ('Alexander Hansson', 34.629999999999995),
 ('Theresa Meszaros', 34.25),
 ('Lucia Roca Miguez', 34.25),
 ('Marta Archuleta Estrada', 34.120000000000005),
 ('Arttu Pettersen', 33.510000000000005),
 ('Jan horak', 33.3),
 ('Elvia Herrera Ramirez', 33.0),
 ('Marbue Osei', 32.88),
 ('Chris  Wesley', 32.64),
 ('Krzysztof Cerny', 32.290000000000006),
 ('Sia Chahine', 31.79),
 ('Dariya Ivanov', 31.68),
 ('Ahuka Tusti', 30.17),
 ('Camillo Randi', 30.03),
 ('Sofia Vinogradov', 29.759999999999998),
 ('Sara Runggaldier', 29.31),
 ('Basimah Mushtaq', 28.77),
 ('Cezmiye Baykal', 28.560000000000002),
 ('Mabuchi Muraguchi', 28.48),
 ('Javier Jurado Jaen', 28.03),
 ('David Titschinger', 26.78),
 ('Anantadeva Sara', 26.42),
 ('Woo Song-Ho', 26.32),
 ('Markus Simon', 25.87),
 ('Amelia Kruger', 25.18),
 ('Flomo Gebremichael', 24.97),
 ('Katsue Kawayama', 24.85),
 ('Lim Ding', 23.84),
 ('Maria Benz', 23.38),
 ('Carlotta Baio', 23.32),
 ('Sarh Wangai', 22.78),
 ('Yelena Novikov', 21.82),
 ('Hillary Davis', 21.78),
 ('Girauda Gaudet', 21.6),
 ('Geavonna Amado Benavides', 21.29),
 ('Viktor Gustafsson', 21.12),
 ('Kofa Sow', 20.19),
 ('Bryson Dodson', 19.99),
 ('Abu Diop', 19.81),
 ('Samson Sall', 19.72),
 ('Inez Estrada Malo', 19.71),
 ('Zwana Desta', 17.97),
 ('Ti Zhi-jun', 17.73),
 ('Martin Sepp', 17.69),
 ('Amelia Jackson', 17.18),
 ('Phan Thinh', 16.84),
 ('Dustin  Putnam', 16.76),
 ('Ho Hong-Do', 16.29),
 ('Johara Shia-Agil', 15.94),
 ('Javier Lankford', 15.71),
 ('Katerina Molnar', 15.3),
 ('Jesus Luther', 15.27),
 ('Xue Bao', 14.77),
 ('Lena Ackermann', 14.51),
 ('Giustina Gandolfi', 14.35),
 ('Daniel Gier', 14.02),
 ('Carlos Maldonado Ruiberriz', 13.39),
 ('Vojtech Kask', 13.36),
 ('Crear Amin', 13.26),
 ('Damian Schaeffer', 12.33),
 ('Lan Dan', 11.88),
 ('Alexander Carlsson', 11.54),
 ('Tehpoe Michieka', 11.36),
 ('Isarn Boirot', 10.9),
 ('Wijdan Al-Ansar', 10.23),
 ('Theresa Feher', 9.82),
 ('Navjot Nalini', 7.9)]

In [45]:
%%sql

SELECT c.name, SUM(p.price) total
FROM orders o, products p, customers c
WHERE p.id = o.product_id AND c.id = o.customer_id
GROUP BY c.id
ORDER BY total DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('Sevil Caker', 315.09),
 ('Pons Baluze', 306.84999999999997),
 ('Boikai Owiti', 297.10999999999996),
 ('Ahmed Onyango', 291.38000000000005),
 ('Bui Tuan', 274.92),
 ('Seth Bowden', 270.44),
 ('Sandra Lakatos', 267.04),
 ('Jonas Papp', 265.48),
 ('Kristina Hovath', 263.03999999999996),
 ('Vasha Nwosu', 260.15000000000003)]

Let's try something more complex. Let's find the total amount of money spent on orders that are shipped internationally for each `billing_country`.

In [83]:
%%sql

SELECT billing_country, SUM(price) as total FROM
customers c, orders o, products p
WHERE c.id = o.customer_id AND o.product_id = p.id
AND c.billing_country != o.delivery_country
GROUP BY billing_country
ORDER BY total DESC
LIMIT 20;

 * sqlite:///testdb.sqlite
Done.

[('Germany', 751.0100000000001),
 ('China', 684.0699999999999),
 ('India', 678.25),
 ('USA', 442.76),
 ('Russia', 397.93),
 ('Japan', 373.2700000000001),
 ('South Korea', 354.82000000000005),
 ('Italy', 343.0799999999999),
 ('France', 287.71000000000004),
 ('Canada', 237.47),
 ('Vietnam', 183.39),
 ('Finland', 170.65),
 ('Spain', 164.24999999999997),
 ('Turkey', 163.89999999999998),
 ('Algeria', 156.49),
 ('Latvia', 141.99),
 ('Egypt', 131.09),
 ('Israel', 125.5),
 ('Cameroon', 122.27000000000001),
 ('Oman', 121.72999999999999)]

In [68]:
%%sql

SELECT * FROM 
    (SELECT c.billing_country, o.delivery_country, price
    FROM orders o, customers c, products p
    WHERE o.customer_id = c.id AND o.product_id = p.id
    GROUP BY delivery_country, billing_country)
WHERE billing_country = 'Canada'
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('Canada', 'Albania', 28.89),
 ('Canada', 'Belarus', 14.08),
 ('Canada', 'Canada', 16.13),
 ('Canada', 'Czech Republic', 19.35),
 ('Canada', 'Egypt', 28.48),
 ('Canada', 'Moldova', 17.53),
 ('Canada', 'Montenegro', 24.07),
 ('Canada', 'Poland', 19.55),
 ('Canada', 'Slovenia', 26.7),
 ('Canada', 'Spain', 20.06)]

In [72]:
%%sql

SELECT * FROM 
    (SELECT c.billing_country, o.delivery_country, price
    FROM orders o, customers c, products p
    WHERE o.customer_id = c.id AND o.product_id = p.id
    GROUP BY delivery_country, billing_country
    HAVING delivery_country != billing_country)
WHERE billing_country = 'Canada'
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('Canada', 'Albania', 28.89),
 ('Canada', 'Belarus', 14.08),
 ('Canada', 'Czech Republic', 19.35),
 ('Canada', 'Egypt', 28.48),
 ('Canada', 'Moldova', 17.53),
 ('Canada', 'Montenegro', 24.07),
 ('Canada', 'Poland', 19.55),
 ('Canada', 'Slovenia', 26.7),
 ('Canada', 'Spain', 20.06),
 ('Canada', 'Tunisia', 18.77)]

In [86]:
%%sql

SELECT sub.billing_country, SUM(sub.rev) spent FROM 
    (SELECT c.billing_country, o.delivery_country, SUM(price) AS rev
    FROM orders o, customers c, products p
    WHERE o.customer_id = c.id AND o.product_id = p.id
    GROUP BY delivery_country, billing_country
    HAVING delivery_country != billing_country) AS sub
GROUP BY sub.billing_country
ORDER BY spent DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('Germany', 751.0099999999999),
 ('China', 684.0699999999999),
 ('India', 678.2499999999998),
 ('USA', 442.76000000000005),
 ('Russia', 397.93),
 ('Japan', 373.27),
 ('South Korea', 354.81999999999994),
 ('Italy', 343.0799999999999),
 ('France', 287.71),
 ('Canada', 237.47000000000003)]

In [82]:
%%sql

SELECT shp.bill, SUM(shp.rev) spent
FROM (SELECT c.billing_country bill, o.delivery_country deliver, SUM(p.price) rev
      FROM orders o, customers c, products p
      WHERE o.customer_id = c.id AND o.product_id = p.id
      GROUP BY bill, deliver
      HAVING bill != deliver) shp
GROUP BY shp.bill
ORDER BY spent DESC
LIMIT 10;

 * sqlite:///testdb.sqlite
Done.

[('Germany', 751.0099999999999),
 ('China', 684.0699999999999),
 ('India', 678.2499999999998),
 ('USA', 442.76000000000005),
 ('Russia', 397.93),
 ('Japan', 373.27),
 ('South Korea', 354.81999999999994),
 ('Italy', 343.0799999999999),
 ('France', 287.71),
 ('Canada', 237.47000000000003)]

The above example makes use of a subquery. Subqueries are often used for constructing intermediate tables that we may use in the computation of a larger query, and are frequently used as part of joins or to perform joins.

## Connecting to a database from Python

In order to load our example data into our database, we created a **database connection**. We then read in our data files with Pandas, and pushed them through the connection to the database. We could have read this data directly into SQL, but database connections allow us to pass data between Python and SQL, allowing web applications or machine learning models operating in Python easy access to persistent databases.

In our case, we used the `sqlite3` module because we are creating a connection to SQLite. There are other connectors for other dialects such a `psycopg2` for PostgreSQL and `mysql` for MySQL. Other packages such as `SQLAlchemy` provide connectors as well as object-relation mapping (ORM), which we will discuss later.

Database connections will typically resemble the example set above

```python
conn = sqlite3.connect("testdb.sqlite")
```

possibly using a URL for connecting to a remotely hosted database and extra parameters for authentication. We can combine the connection with Pandas methods for [reading from](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_sql.html) and [writing to](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_sql.html) SQL.

*Copyright &copy; 2018 The Data Incubator.  All rights reserved.*